In [1]:
import numpy
import matplotlib.pyplot as plt
import pandas

In [2]:
penguins_data = pandas.read_csv('penguins_size.csv')

In [3]:
penguins_data

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [4]:
print(penguins_data.isnull().sum())

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [5]:
penguins_data["culmen_length_mm"].fillna(penguins_data['culmen_length_mm'].mean(), inplace=True)
print(penguins_data.isnull().sum())

species               0
island                0
culmen_length_mm      0
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [6]:
penguins_data["culmen_depth_mm"].fillna(penguins_data['culmen_depth_mm'].mean(), inplace=True)
print(penguins_data.isnull().sum())

species               0
island                0
culmen_length_mm      0
culmen_depth_mm       0
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [7]:
penguins_data["flipper_length_mm"].fillna(penguins_data['flipper_length_mm'].mean(), inplace=True)
print(penguins_data.isnull().sum())

species               0
island                0
culmen_length_mm      0
culmen_depth_mm       0
flipper_length_mm     0
body_mass_g           2
sex                  10
dtype: int64

In [8]:
penguins_data["body_mass_g"].fillna(penguins_data['body_mass_g'].mean(), inplace=True)
print(penguins_data.isnull().sum())

species               0
island                0
culmen_length_mm      0
culmen_depth_mm       0
flipper_length_mm     0
body_mass_g           0
sex                  10
dtype: int64

In [9]:
penguins_data["sex"].fillna(penguins_data['sex'].value_counts().index[0], inplace=True)
print(penguins_data.isnull().sum())

species              0
island               0
culmen_length_mm     0
culmen_depth_mm      0
flipper_length_mm    0
body_mass_g          0
sex                  0
dtype: int64

In [10]:
penguins_data

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.10000,18.70000,181.000000,3750.000000,MALE
1,Adelie,Torgersen,39.50000,17.40000,186.000000,3800.000000,FEMALE
2,Adelie,Torgersen,40.30000,18.00000,195.000000,3250.000000,FEMALE
3,Adelie,Torgersen,43.92193,17.15117,200.915205,4201.754386,MALE
4,Adelie,Torgersen,36.70000,19.30000,193.000000,3450.000000,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,43.92193,17.15117,200.915205,4201.754386,MALE
340,Gentoo,Biscoe,46.80000,14.30000,215.000000,4850.000000,FEMALE
341,Gentoo,Biscoe,50.40000,15.70000,222.000000,5750.000000,MALE
342,Gentoo,Biscoe,45.20000,14.80000,212.000000,5200.000000,FEMALE
343,Gentoo,Biscoe,49.90000,16.10000,213.000000,5400.000000,MALE

In [11]:
#Categorical Encoding

In [12]:
penguins_data.dtypes

species               object
island                object
culmen_length_mm     float64
culmen_depth_mm      float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
dtype: object

In [15]:
penguins_data["species"] = penguins_data["species"].astype('category')
penguins_data["island"] = penguins_data["island"].astype('category')
penguins_data["sex"] = penguins_data["sex"].astype('category')
penguins_data.dtypes

species              category
island               category
culmen_length_mm      float64
culmen_depth_mm       float64
flipper_length_mm     float64
body_mass_g           float64
sex                  category
dtype: object

In [17]:
categorical_data = penguins_data.drop(['culmen_length_mm', 'culmen_depth_mm', 'flipper_length_mm', 'body_mass_g'], axis=1)
categorical_data.head()

  species     island     sex
0  Adelie  Torgersen    MALE
1  Adelie  Torgersen  FEMALE
2  Adelie  Torgersen  FEMALE
3  Adelie  Torgersen    MALE
4  Adelie  Torgersen  FEMALE

In [20]:
categorical_data["species_cat"] = categorical_data["species"].cat.codes
categorical_data["island_cat"] = categorical_data["island"].cat.codes
categorical_data["sex_cat"] = categorical_data["sex"].cat.codes
categorical_data

    species     island     sex  species_cat  island_cat  sex_cat
0    Adelie  Torgersen    MALE            0           2        2
1    Adelie  Torgersen  FEMALE            0           2        1
2    Adelie  Torgersen  FEMALE            0           2        1
3    Adelie  Torgersen    MALE            0           2        2
4    Adelie  Torgersen  FEMALE            0           2        1
..      ...        ...     ...          ...         ...      ...
339  Gentoo     Biscoe    MALE            2           0        2
340  Gentoo     Biscoe  FEMALE            2           0        1
341  Gentoo     Biscoe    MALE            2           0        2
342  Gentoo     Biscoe  FEMALE            2           0        1
343  Gentoo     Biscoe    MALE            2           0        2

[344 rows x 6 columns]

In [22]:
encoded_species = pandas.get_dummies(categorical_data['species'])
print(encoded_species)

     Adelie  Chinstrap  Gentoo
0         1          0       0
1         1          0       0
2         1          0       0
3         1          0       0
4         1          0       0
..      ...        ...     ...
339       0          0       1
340       0          0       1
341       0          0       1
342       0          0       1
343       0          0       1

[344 rows x 3 columns]

In [24]:
encoded_island = pandas.get_dummies(categorical_data['island'])
encoded_sex = pandas.get_dummies(categorical_data['sex'])

In [26]:
categorical_data = categorical_data.join(encoded_species)
categorical_data = categorical_data.join(encoded_island)
categorical_data = categorical_data.join(encoded_sex)

In [27]:
categorical_data

,species,island,sex,species_cat,island_cat,sex_cat,Adelie,Chinstrap,Gentoo,Biscoe,Dream,Torgersen,.,FEMALE,MALE
0,Adelie,Torgersen,MALE,0,2,2,1,0,0,0,0,1,0,0,1
1,Adelie,Torgersen,FEMALE,0,2,1,1,0,0,0,0,1,0,1,0
2,Adelie,Torgersen,FEMALE,0,2,1,1,0,0,0,0,1,0,1,0
3,Adelie,Torgersen,MALE,0,2,2,1,0,0,0,0,1,0,0,1
4,Adelie,Torgersen,FEMALE,0,2,1,1,0,0,0,0,1,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,MALE,2,0,2,0,0,1,1,0,0,0,0,1
340,Gentoo,Biscoe,FEMALE,2,0,1,0,0,1,1,0,0,0,1,0
341,Gentoo,Biscoe,MALE,2,0,2,0,0,1,1,0,0,0,0,1
342,Gentoo,Biscoe,FEMALE,2,0,1,0,0,1,1,0,0,0,1,0
343,Gentoo,Biscoe,MALE,2,0,2,0,0,1,1,0,0,0,0,1

In [ ]:
#Count encoding

In [28]:
species_count = categorical_data['species'].value_counts()
island_count = categorical_data['island'].value_counts()
sex_count = categorical_data['sex'].value_counts()

In [29]:
categorical_data['species_count_enc'] = categorical_data['species'].map(species_count)
categorical_data['island_count_enc'] = categorical_data['island'].map(island_count)
categorical_data['sex_count_enc'] = categorical_data['sex'].map(sex_count)

In [30]:
categorical_data

,species,island,sex,species_cat,island_cat,sex_cat,Adelie,Chinstrap,Gentoo,Biscoe,Dream,Torgersen,.,FEMALE,MALE,species_count_enc,island_count_enc,sex_count_enc
0,Adelie,Torgersen,MALE,0,2,2,1,0,0,0,0,1,0,0,1,152,52,178
1,Adelie,Torgersen,FEMALE,0,2,1,1,0,0,0,0,1,0,1,0,152,52,165
2,Adelie,Torgersen,FEMALE,0,2,1,1,0,0,0,0,1,0,1,0,152,52,165
3,Adelie,Torgersen,MALE,0,2,2,1,0,0,0,0,1,0,0,1,152,52,178
4,Adelie,Torgersen,FEMALE,0,2,1,1,0,0,0,0,1,0,1,0,152,52,165
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,MALE,2,0,2,0,0,1,1,0,0,0,0,1,124,168,178
340,Gentoo,Biscoe,FEMALE,2,0,1,0,0,1,1,0,0,0,1,0,124,168,165
341,Gentoo,Biscoe,MALE,2,0,2,0,0,1,1,0,0,0,0,1,124,168,178
342,Gentoo,Biscoe,FEMALE,2,0,1,0,0,1,1,0,0,0,1,0,124,168,165
343,Gentoo,Biscoe,MALE,2,0,2,0,0,1,1,0,0,0,0,1,124,168,178